scheduleBackend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 15 LIMIT 1
---
    def current_user
      if decoded_token
        user_id = decoded_token[0]['user_id']
        @current_user ||= User.find_by(id: user_id)