scheduleBackend/app/controllers/tasks_controller.rb

        task = Task.new(task_params.permit(:title, :start_time, :end_time, :am_start, :am_end, days_of_week: []))
        if task.save
---
INSERT INTO "tasks" ("title", "start_date", "end_date", "deadline", "priority", "user_id", "start_time", "end_time", "days_of_week", "am_start", "am_end") VALUES ('happa', NULL, NULL, NULL, NULL, NULL, '7', '8', 'M,T', 1, 1) RETURNING "id"

    def index
      # Return all tasks
      tasks = Task.all
---
SELECT "tasks".* FROM "tasks"