scheduleBackend/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "canvas_api_token", "refresh_token", "refresh_token_expires_at") VALUES ('TestUser', 'testTest@gmail.com', '$2a$12$N.gzfrH5TbFTtaqURNfevuV2I/LR5PiIMqXcYnwSf.oIJK/L2DnXW', '2025-04-08 19:31:53.130997', '2025-04-08 19:31:53.130997', NULL, NULL, NULL) RETURNING "id"
---
  def create
    user = User.new(user_params)
    if user.save

SELECT "users".* FROM "users" WHERE "users"."name" = 'wronguser' LIMIT 1
---
  def login
    user = User.find_by(name: params[:name])

SELECT "users".* FROM "users"
---
  def debug_index

    users = User.all.map do |user|