scheduleBackend/app/controllers/api/v1/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'testTest@example.com' LIMIT 1
---
        def login
            user = User.find_by(email: params[:email])