scheduleBackend/app/controllers/api/v1/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = 'TestUser' LIMIT 1
UPDATE "users" SET "updated_at" = '2025-04-08 19:34:39.335848', "refresh_token" = '3e2cdb8445fb7eab1ad582d92d4c0d1c2efdb4cb1da3b063e919b613be60ecb6', "refresh_token_expires_at" = '2025-05-08 19:34:39.320137' WHERE "users"."id" = 15
---
        def login
            user = User.find_by(name: params[:name])

            if user&.authenticate(params[:password])
              access_token = encode_access_token(user)
              refresh_token = SecureRandom.hex(32)

              user.update(
                refresh_token: refresh_token,
                refresh_token_expires_at: 30.days.from_now
              )

SELECT "users".* FROM "users" WHERE "users"."refresh_token" = '37222f50641feef38057dceb46644f266cd7a328d0dab20065984067f9da7691' LIMIT 1
UPDATE "users" SET "updated_at" = '2025-04-27 00:18:35.814654', "refresh_token" = '9a40efb547c0891ab86941a08f247fde006dea631bf32e65a76f3fa1189cd7fa', "refresh_token_expires_at" = '2025-05-27 00:18:35.810781' WHERE "users"."id" = 21
---
        def refresh
            user = User.find_by(refresh_token: params[:refresh_token])

            if user && user.refresh_token_expires_at && user.refresh_token_expires_at > Time.current
              new_access_token = encode_access_token(user)

              # OPTIONAL: rotate refresh token here for extra security
              new_refresh_token = SecureRandom.hex(32)

              user.update(
                refresh_token: new_refresh_token,
                refresh_token_expires_at: 30.days.from_now
              )