scheduleBackend/app/controllers/api/v1/canvas_controller.rb

      def set_canvas_service
        user_id = params[:user_id] || current_user.id # fallback to current_user if no param
        user = User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 22 LIMIT 1