scheduleBackend/app/controllers/api/v1/tasks_controller.rb

INSERT INTO "tasks" ("title", "start_date", "end_date", "deadline", "priority", "user_id", "start_time", "end_time", "days_of_week", "am_start", "am_end") VALUES ('Lunch', NULL, NULL, NULL, NULL, 22, '12:00', '01:00', '', 0, 0) RETURNING "id"
---
          task = Task.new(task_params.permit(:title, :start_time, :end_time, :am_start, :am_end, :user_id, days_of_week: []))

          if task.save

SELECT "tasks".* FROM "tasks"
---
      def index
        tasks = Task.all

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = 22
---
      def task_by_user
        user_id = params[:user_id]
        tasks = Task.where(user_id: user_id)

UPDATE "tasks" SET "days_of_week" = 'M,T,W,S,F,TH' WHERE "tasks"."id" = 67
---
      def update
        if @task.update(task_params)

DELETE FROM "tasks" WHERE "tasks"."id" = 60
---
      def destroy
        if @task.destroy

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 60 LIMIT 1
---
      def set_task
        @task = Task.find(params[:id])