scheduleBackend/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "canvas_api_token", "refresh_token", "refresh_token_expires_at") VALUES ('UserTest', 't@gmail.com', '$2a$12$NOJh/1vBG5Cc/RTFivWtMuaryjutfNFz6O1BN4zYSV2zhj1NoSuNa', '2025-04-14 14:52:03.962913', '2025-04-14 14:52:03.962913', NULL, NULL, NULL) RETURNING "id"
---
      def create
        user = User.new(user_params)
        if user.save